SushiBits/platform-stm32f4/include/stm32f410tx_handler.h
/* This file is auto-generated using the IRQN tool. Do not modify. */

#ifndef IRQN_HANDLER

#include <stm32f4xx_it.h>

#else

IRQN_HANDLER(-14, NonMaskableInt)
SKIP_HANDLER(-13)
IRQN_HANDLER(-12, MemoryManagement)
IRQN_HANDLER(-11, BusFault)
IRQN_HANDLER(-10, UsageFault)
SKIP_HANDLER(-9)
SKIP_HANDLER(-8)
SKIP_HANDLER(-7)
SKIP_HANDLER(-6)
IRQN_HANDLER(-5, SVCall)
IRQN_HANDLER(-4, DebugMonitor)
SKIP_HANDLER(-3)
IRQN_HANDLER(-2, PendSV)
IRQN_HANDLER(-1, SysTick)
IRQN_HANDLER(0, WWDG)
IRQN_HANDLER(1, PVD)
IRQN_HANDLER(2, TAMP_STAMP)
IRQN_HANDLER(3, RTC_WKUP)
IRQN_HANDLER(4, FLASH)
IRQN_HANDLER(5, RCC)
IRQN_HANDLER(6, EXTI0)
IRQN_HANDLER(7, EXTI1)
IRQN_HANDLER(8, EXTI2)
IRQN_HANDLER(9, EXTI3)
IRQN_HANDLER(10, EXTI4)
IRQN_HANDLER(11, DMA1_Stream0)
IRQN_HANDLER(12, DMA1_Stream1)
IRQN_HANDLER(13, DMA1_Stream2)
IRQN_HANDLER(14, DMA1_Stream3)
IRQN_HANDLER(15, DMA1_Stream4)
IRQN_HANDLER(16, DMA1_Stream5)
IRQN_HANDLER(17, DMA1_Stream6)
IRQN_HANDLER(18, ADC)
SKIP_HANDLER(19)
SKIP_HANDLER(20)
SKIP_HANDLER(21)
SKIP_HANDLER(22)
IRQN_HANDLER(23, EXTI9_5)
IRQN_HANDLER(24, TIM1_BRK_TIM9)
SKIP_HANDLER(25)
IRQN_HANDLER(26, TIM1_TRG_COM_TIM11)
IRQN_HANDLER(27, TIM1_CC)
SKIP_HANDLER(28)
SKIP_HANDLER(29)
SKIP_HANDLER(30)
IRQN_HANDLER(31, I2C1_EV)
IRQN_HANDLER(32, I2C1_ER)
IRQN_HANDLER(33, I2C2_EV)
IRQN_HANDLER(34, I2C2_ER)
IRQN_HANDLER(35, SPI1)
SKIP_HANDLER(36)
IRQN_HANDLER(37, USART1)
IRQN_HANDLER(38, USART2)
SKIP_HANDLER(39)
IRQN_HANDLER(40, EXTI15_10)
IRQN_HANDLER(41, RTC_Alarm)
SKIP_HANDLER(42)
SKIP_HANDLER(43)
SKIP_HANDLER(44)
SKIP_HANDLER(45)
SKIP_HANDLER(46)
IRQN_HANDLER(47, DMA1_Stream7)
SKIP_HANDLER(48)
SKIP_HANDLER(49)
IRQN_HANDLER(50, TIM5)
SKIP_HANDLER(51)
SKIP_HANDLER(52)
SKIP_HANDLER(53)
IRQN_HANDLER(54, TIM6_DAC)
SKIP_HANDLER(55)
IRQN_HANDLER(56, DMA2_Stream0)
IRQN_HANDLER(57, DMA2_Stream1)
IRQN_HANDLER(58, DMA2_Stream2)
IRQN_HANDLER(59, DMA2_Stream3)
IRQN_HANDLER(60, DMA2_Stream4)
SKIP_HANDLER(61)
SKIP_HANDLER(62)
SKIP_HANDLER(63)
SKIP_HANDLER(64)
SKIP_HANDLER(65)
SKIP_HANDLER(66)
SKIP_HANDLER(67)
IRQN_HANDLER(68, DMA2_Stream5)
IRQN_HANDLER(69, DMA2_Stream6)
IRQN_HANDLER(70, DMA2_Stream7)
SKIP_HANDLER(71)
SKIP_HANDLER(72)
SKIP_HANDLER(73)
SKIP_HANDLER(74)
SKIP_HANDLER(75)
SKIP_HANDLER(76)
SKIP_HANDLER(77)
SKIP_HANDLER(78)
SKIP_HANDLER(79)
IRQN_HANDLER(80, RNG)
IRQN_HANDLER(81, FPU)
SKIP_HANDLER(82)
SKIP_HANDLER(83)
SKIP_HANDLER(84)
SKIP_HANDLER(85)
SKIP_HANDLER(86)
SKIP_HANDLER(87)
SKIP_HANDLER(88)
SKIP_HANDLER(89)
SKIP_HANDLER(90)
SKIP_HANDLER(91)
SKIP_HANDLER(92)
SKIP_HANDLER(93)
SKIP_HANDLER(94)
IRQN_HANDLER(95, FMPI2C1_EV)
IRQN_HANDLER(96, FMPI2C1_ER)
IRQN_HANDLER(97, LPTIM1)

#endif

